@xuzhang3 I have tried creating another project with a different custom work item template and it is working as expected. 
I am still not able to identify the issue with the first template, but I guess we can close this issue
Thank you so much for your efforts

```
Terraform will perform the following actions:

  # azuredevops_project.demonew will be created
  + resource "azuredevops_project" "demonew" {
      + description         = "The new Demo project"
      + id                  = (known after apply)
      + name                = "DemoNew"
      + process_template_id = (known after apply)
      + version_control     = "Git"
      + visibility          = "private"
      + work_item_template  = "DemoNew Scrum"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + project_id          = "Demo"
  + project_id_demo_new = (known after apply)


azdevops % terraform state show azuredevops_project.demonew
# azuredevops_project.demonew:
resource "azuredevops_project" "demonew" {
    description         = "The new Demo project"
    id                  = "4e1173cf-*******44c163f15"
    name                = "Demo"
    process_template_id = "d0f95d1c-*********6d24fa507"
    version_control     = "Git"
    visibility          = "private"
    work_item_template  = "DemoNew Scrum"
}
```